/*Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
452 -> 11
82 -> 10
9012 -> 12*/


int SumOfDigits(int num)
{
    return sum;
}

Console.Write("Enter number: ");
int number = Convert.ToInt32(Console.ReadLine());